app/controllers/products_controller.rb

   def index
    @products = Product.order("RANDOM()").includes(:user).limit(3)
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "vendor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "MyString"], ["price", 1], ["vendor", "MyString"], ["created_at", "2020-11-04 11:44:43.861997"], ["updated_at", "2020-11-04 11:44:43.861997"]]

  def update
    product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    @product = Product.find(params[:id])
    if @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 980190962]]